Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes.TransparentBackground Property
 The mark text background transparency. (transparent/opaque)
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace